import { Component } from '@angular/core';
import { FormControl,FormGroup } from '@angular/forms';
@Component({
  selector: 'app-user-profile',
  templateUrl: './user-profile.component.html',
  styleUrls: ['./user-profile.component.css']
})
export class UserProfileComponent {

  name="A S Patil Nadahalli";
  location="Dasoha Nilaya Muddebihala – 586212. Vijayapura District";
  phoneno="9900056969";
  email="muddebihal.mla@karnataka.gov.in";
  save="https://vc.pcubeapi.com/profile.php?pid=2";
  aboutme="ಶ್ರೀ ಎ.ಎಸ್.ಪಾಟೀಲ(ನಡಹಳ್ಳಿ) ರವರು ವಿಜಯಪೂರ ಜಿಲ್ಲೆಯ ಮುದ್ದೇಬಿಹಾಳ ತಾಲೂಕಿನ ನಡಹಳ್ಳಿ ಗ್ರಾಮದಲ್ಲಿ ಸಾಮಾನ್ಯ ಕುಟುಂಬದಲ್ಲಿ 22 ಜುಲೈ 1969 ರಂದು ಜನಿಸಿದರು.ಅವರ ತಂದೆ ಶ್ರೀ ಸಂಗನಗೌಡ ಪಾಟೀಲ ಮತ್ತು ತಾಯಿ ಗಂಗೂಬಾಯಿ ಅವರ ಆರು ಮಕ್ಕಳಲ್ಲಿ ಇವರು ಮೂರನೆಯವರು.ಎ.ಎಸ್.ಪಾಟೀಲ (ನಡಹಳ್ಳಿ) ರವರು ತಮ್ಮ ಪ್ರಾಥಮಿಕ ಶಿಕ್ಷಣವನ್ನು ತಮ್ಮ ಸ್ವಗ್ರಾಮದಲ್ಲಿ ಮುಗಿಸಿದರು.ನಂತರ ತುಮಕೂರಿನ ಶ್ರೀ ಸಿದ್ಧಗಂಗಾ ಮಠಕ್ಕೆ ತೆರಳಿ ಡಾ॥ಶ್ರೀ ಶಿವಕುಮಾರ ಸ್ವಾಮೀಜಿಯವರ ಆಶ್ರಯದಲ್ಲಿ ಪ್ರೌಢಶಾಲಾ ಶಿಕ್ಷಣ ಮುಗಿಸಿದರು.ಅವರು ಮಠದ ಸಂಸ್ಕಾರದಲ್ಲಿ ಬೆಳೆದ ಕಾರಣ ಅವರು ಅಲ್ಲಿ ಆಧ್ಯಾತ್ಮಿಕತೆ,ಸಾಮಾಜಿಕ ಸೇವೆ ಮತ್ತು ಇತರ ನೈತಿಕ ಮೌಲ್ಯಗಳನ್ನು ಅಳವಡಿಸಿಕೊಂಡರು.ಮುಂದೆ ಅವರು ತಮ್ಮ ಉನ್ನತ ವ್ಯಾಸಂಗವನ್ನು ಧಾರವಾಡದಲ್ಲಿ ಪೂಣ೯ಗೊಳಿಸಿದರು ಮತ್ತು ನಂತರ ಧಾರವಾಡದ ಕನಾ೯ಟಕ ವಿಶ್ವ ವಿದ್ಯಾಲಯದಿಂದ ಭೂವಿಜ್ಞಾನದಲ್ಲಿ ಸ್ನಾತಕೋತ್ತರ ಪದವಿ ಪಡೆದರು.ಹುಟ್ಟು ಹೋರಾಟದ ಮನೋಭಾವ ಹೊಂದಿರುವ ಇವರು ವಿಧ್ಯಾಥಿ೯ ಜೀವನದಲ್ಲಿ ಅನೇಕ ಹೋರಾಟಗಳನ್ನು ಮಾಡುತ್ತ ವಿಧ್ಯಾಥಿ೯ ನಾಯಕರಾಗಿ ಹೊರಹೊಮ್ಮಿದರು.ಅವರು ತಮ್ಮ ವಿದ್ಯಾರ್ಥಿ ಜೀವನದ ನಂತರ ತಮ್ಮ ವೃತ್ತಿ ಜೀವನವನ್ನು ಪ್ರಾರಂಭಿಸಿದರು.ಗಣಿಗಾರಿಕೆಯಲ್ಲಿ ಆಸಕ್ತಿಯಿಂದ 1995 ರಲ್ಲಿ ಸಂಡೂರಿಗೆ ತೆರಳಿ ವಿ ಎಸ್ ಲಾಡ್ ಆ್ಯಂಡ್ ಕಂಪನಿಯಲ್ಲಿ ಕೆಲಸ ಪಡೆದುಕೊಂಡು ಅವರು ತಮ್ಮ ಪರಿಶ್ರಮ ಪ್ರಾಮಾಣಿಕತೆಯಿಂದ ವೇಗವಾಗಿ ಕೆಲಸದ ಏಣಿಯನ್ನು ಏರಿದರು ಮತ್ತು ಆರು ವರ್ಷದ ಅವಧಿಯಲ್ಲಿ ಕಂಪನಿಯ ಹಿರಿಯ ಮೈನಿಂಗ್ ಇಂಜಿನಿಯರ್ ಆದರು 2006 ರಲ್ಲಿ ಸಂಡೂರಿನಲ್ಲಿ ಸ್ವಂತ ಉದ್ಯಮಿಗೆ ಇಳಿದು ಸಾವಿರಾರು ಜನರಿಗೆ ಉದ್ಯೋಗ ವದಗಿಸಿದರು.ಬುಧ್ಧ ಬಸವ ಅಂಬೇಡ್ಕರವರ ಹಾಗೂ ಶ್ರೀ ಸಿದ್ಧಗಂಗಾ ಶ್ರೀಗಳ ಬೋಧನೆಗಳಿಂದ ಪ್ರೇರಿತರಾದ ಇವರು ಬಡವರ ಶೋಷಿತ ವಗ೯ದ ಜನರ ಏಳಿಗೆಗಾಗಿ ತಮ್ಮದೇ ಆದ ರೀತಿಯಲ್ಲಿ ಕೊಡುಗೆ ನೀಡಲು ತಮ್ಮನ್ನು ತಾವು ತೊಡಗಿಸಿಕೊಂಡರು.ತಮ್ಮ ಬಾಲ್ಯದ ದಿನಗಳಲ್ಲಿ ಶಿಕ್ಷಣ ಪಡೆಯಲು ಅವರು ಎದುರಿಸಿದ ತೊಂದರೆಗಳನ್ನು ಗಮನದಲ್ಲಿಟ್ಟುಕೊಂಡು ಅವರು ತಮ್ಮ ಒಟ್ಟು ಆದಾಯದ 25\% ಬಾಗವನ್ನು ಆಥಿ೯ಕವಾಗಿ ಹಿಂದುಳಿದವರ ಬಡವರ ಶಿಕ್ಷಣಕ್ಕೆ ಹಾಗೂ ಬಡವರ ಏಳಿಗೆಗೆ ಮೀಸಲಿಡಲು ಪ್ರೇರೆಪಿಸಿತು.ಮುಂದೆ ಇವರ ಜನಸೇವೆಯನ್ನು ಮೆಚ್ಚಿದ ಜನತೆ ಇವರನ್ನು ರಾಜಕೀಯಕ್ಕೆ ಬರಲು ಒತ್ತಾಯಿಸಿದರೂ.ಇಂದಿಗೂ ಶ್ರೀ ಎ.ಎಸ್.ಪಾಟೀಲರು ರಾಜಕೀಯದ ಜೊತೆಗೆ ಸಮಾಜ ಸೇವೆಯಲ್ಲಿ ತಮ್ಮನ್ನು ತೊಡಗಿಸಿಕೊಂಡು ಬಡವರ ಸೇವೆಯೇ ದೇವರ ಪೂಜೆ ಎಂಬ ಭಾವನೆಯನ್ನು ಮನದಲ್ಲಿಟ್ಟುಕೊಂಡು ಬಡವರ ಸೇವೆಯನ್ನು ಮಾಡುತ್ತ ಬಂದಿದ್ದಾರೆ ಇಂತಹ ಜನಸೇವಕನನ್ನು ಮತ್ತೆ ಜನಸೇವೆಗೆಂದು ಶಾಸಕರಾಗಿಸುವ ಸೌಭಾಗ್ಯ ನಮಗೆ ಬಂದಿದೆ ಇವರನ್ನು ಮತ್ತೆ ಶಾಸಕರಾಗಿ ಮಾಡಲು ನಾವು ನಿವೇಲ್ಲರೂ ಬೆಂಬಲಿಸೋಣ.";
  youtube="https://youtube.com/@soothingdews911";
  insta="https://www.instagram.com/accounts/login/";
  facebook="https://m.facebook.com/login/?refsrc=deprecated";
  twitterId="https://twitter.com/i/flow/login";
    
}

